Revit 2024 API
BuiltInFailures.RebarSystemFailures.LessThanTwoBars Property
 Each reinforcement direction requires at least 2 bars. Please increase the number of bars.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId LessThanTwoBars { get; }
Visual Basic
Public Shared ReadOnly Property LessThanTwoBars As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ LessThanTwoBars {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarSystemFailures Class
Autodesk.Revit.DB Namespace